{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.4.0", "userDefinedMetadata": {"signature": {"inputs": {"swa_model/bin_inputs:0": {"name": "swa_model/bin_inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "81"}, {"size": "22"}]}}, "swa_model/global_inputs:0": {"name": "swa_model/global_inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "19"}]}}}, "outputs": {"swa_model/ownership_output:0": {"name": "swa_model/ownership_output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "9"}, {"size": "9"}]}}, "swa_model/miscvalues_output:0": {"name": "swa_model/miscvalues_output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "swa_model/policy_output:0": {"name": "swa_model/policy_output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "82"}]}}, "swa_model/value_output:0": {"name": "swa_model/value_output:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "swa_model/mv3/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}}}, {"name": "swa_model/mv3/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/miscvalues_output/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/vownership/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_6/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_7/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "swa_model/cond_8/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "swa_model/ownership_output/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "swa_model/p1/intermediate_conv/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/p1/norm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_3/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_3/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/Tensordot_3/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/matmulg2w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_3/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_3/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_3/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot_3/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/p2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_3/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_33/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_5/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "swa_model/Reshape_8/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/Tensordot_4/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Mean_2/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape_7/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/sub_2/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/swa_model/truediv_2_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/g1/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}}}, {"name": "swa_model/g1/norm/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "swa_model/Max_2/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "swa_model/concat_2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_4/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/matmulpass", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_9/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/concat_3/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/policy_output/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "swa_model/sub_5/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/swa_model/truediv_3_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "swa_model/trunk/norm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_10/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}}}, {"name": "swa_model/rconv5/norm2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_2/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot_2/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/GatherV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/Tensordot_2/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/rconv5/w1r", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "64"}]}}}}}, {"name": "swa_model/Mean_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "swa_model/Reshape_5/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/sub_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/swa_model/truediv_1_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_5/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv3/norm2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot_1/axes", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot_1/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/rconv3/w1r", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "swa_model/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/sub/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/swa_model/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "swa_model/conv1/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "22"}, {"size": "96"}]}}}}}, {"name": "swa_model/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/global_inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "19"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/ginputw", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "19"}, {"size": "96"}]}}}}}, {"name": "swa_model/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/rconv1/norm1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_1/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv1/norm2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv1/w2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv2/norm1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_3/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv2/norm2/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/rconv2/w2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv3/norm1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv3/w1b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv3/norm1b/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/Tensordot_1/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "swa_model/Tensordot_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "swa_model/Tensordot_1/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/rconv3/norm2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv3/w2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv4/norm1/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/Conv2D_8/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv4/norm2/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/rconv4/w2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv5/norm1/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/w1b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/norm1b/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Max_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/free", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_2/Const_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/Tensordot_2/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/rconv5/norm2/gamma", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv5/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv6/norm1/beta", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "swa_model/Conv2D_13/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}}}, {"name": "swa_model/rconv6/norm2/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/rconv6/w2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/v1/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "32"}]}}}}}, {"name": "swa_model/v1/norm/beta", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean_3/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "swa_model/bin_inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "81"}, {"size": "22"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "swa_model/cond_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "swa_model/cond_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "swa_model/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/Sum_1/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape_11/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "swa_model/sub_6/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "ConstantFolding/swa_model/truediv_4_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "swa_model/sub_7/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "swa_model/concat_4/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/v2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/v2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/v3/w", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "3"}]}}}}}, {"name": "swa_model/v3/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "swa_model/value_output/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_6/switch_pred/_26", "op": "Switch", "input": ["swa_model/cond_6/Const", "swa_model/cond_6/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_7/switch_pred/_34", "op": "Switch", "input": ["swa_model/cond_7/Const", "swa_model/cond_7/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_8/switch_pred/_42", "op": "Switch", "input": ["swa_model/cond_8/Const", "swa_model/cond_8/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_3/switch_pred/_50", "op": "Switch", "input": ["swa_model/cond_3/Const", "swa_model/cond_3/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_4/switch_pred/_58", "op": "Switch", "input": ["swa_model/cond_4/Const", "swa_model/cond_4/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_5/switch_pred/_66", "op": "Switch", "input": ["swa_model/cond_5/Const", "swa_model/cond_5/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/Tensordot/Shape", "op": "Shape", "input": ["swa_model/global_inputs"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape", "op": "Reshape", "input": ["swa_model/bin_inputs", "swa_model/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/cond/switch_pred/_2", "op": "Switch", "input": ["swa_model/cond/Const", "swa_model/cond/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_1/switch_pred/_10", "op": "Switch", "input": ["swa_model/cond_1/Const", "swa_model/cond_1/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_2/switch_pred/_18", "op": "Switch", "input": ["swa_model/cond_2/Const", "swa_model/cond_2/Const"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_6/pivot_t/_28", "op": "Identity", "input": ["swa_model/cond_6/switch_pred/_26:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_7/pivot_t/_36", "op": "Identity", "input": ["swa_model/cond_7/switch_pred/_34:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_8/pivot_t/_44", "op": "Identity", "input": ["swa_model/cond_8/switch_pred/_42:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_3/pivot_t/_52", "op": "Identity", "input": ["swa_model/cond_3/switch_pred/_50:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_4/pivot_t/_60", "op": "Identity", "input": ["swa_model/cond_4/switch_pred/_58:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_5/pivot_t/_68", "op": "Identity", "input": ["swa_model/cond_5/switch_pred/_66:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/Tensordot/GatherV2", "op": "GatherV2", "input": ["swa_model/Tensordot/Shape", "swa_model/Tensordot/free", "swa_model/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "swa_model/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["swa_model/Tensordot/Shape", "swa_model/Tensordot/axes", "swa_model/Tensordot/GatherV2_1/axis"], "attr": {"batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "swa_model/cond/swa_model/Reshape/_5", "op": "Switch", "input": ["swa_model/Reshape", "swa_model/cond/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond/pivot_t/_4", "op": "Identity", "input": ["swa_model/cond/switch_pred/_2:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_1/pivot_t/_12", "op": "Identity", "input": ["swa_model/cond_1/switch_pred/_10:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_2/pivot_t/_20", "op": "Identity", "input": ["swa_model/cond_2/switch_pred/_18:1"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "swa_model/cond_6/then/_24/transpose/perm", "op": "Const", "input": ["^swa_model/cond_6/pivot_t/_28"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_7/then/_32/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_7/pivot_t/_36"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_8/then/_40/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_8/pivot_t/_44"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "swa_model/cond_3/then/_48/transpose/perm", "op": "Const", "input": ["^swa_model/cond_3/pivot_t/_52"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "swa_model/cond_4/then/_56/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_4/pivot_t/_60"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_5/then/_64/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_5/pivot_t/_68"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/Prod", "op": "Prod", "input": ["swa_model/Tensordot/GatherV2", "swa_model/Tensordot/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/Prod_1", "op": "Prod", "input": ["swa_model/Tensordot/GatherV2_1", "swa_model/Tensordot/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "swa_model/cond/then/_0/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond/pivot_t/_4"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_1/then/_8/ReverseV2/axis", "op": "Const", "input": ["^swa_model/cond_1/pivot_t/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_2/then/_16/transpose/perm", "op": "Const", "input": ["^swa_model/cond_2/pivot_t/_20"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot/stack", "op": "Pack", "input": ["swa_model/Tensordot/Prod", "swa_model/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "swa_model/cond/then/_0/ReverseV2", "op": "ReverseV2", "input": ["swa_model/cond/swa_model/Reshape/_5:1", "swa_model/cond/then/_0/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot/Reshape", "op": "Reshape", "input": ["swa_model/global_inputs", "swa_model/Tensordot/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/cond/output/_6", "op": "Merge", "input": ["swa_model/cond/then/_0/ReverseV2", "swa_model/cond/swa_model/Reshape/_5"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/Tensordot/MatMul", "op": "MatMul", "input": ["swa_model/Tensordot/Reshape", "swa_model/ginputw"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_1/swa_model/cond/Identity/_13", "op": "Switch", "input": ["swa_model/cond/output/_6", "swa_model/cond_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_1", "op": "Reshape", "input": ["swa_model/Tensordot/MatMul", "swa_model/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_1/then/_8/ReverseV2", "op": "ReverseV2", "input": ["swa_model/cond_1/swa_model/cond/Identity/_13:1", "swa_model/cond_1/then/_8/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_1/output/_14", "op": "Merge", "input": ["swa_model/cond_1/then/_8/ReverseV2", "swa_model/cond_1/swa_model/cond/Identity/_13"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_2/swa_model/cond_1/Identity/_21", "op": "Switch", "input": ["swa_model/cond_1/output/_14", "swa_model/cond_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/cond_2/then/_16/transpose_0", "op": "Transpose", "input": ["swa_model/cond_2/swa_model/cond_1/Identity/_21:1", "swa_model/cond_2/then/_16/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "swa_model/cond_2/output/_22", "op": "Merge", "input": ["swa_model/cond_2/then/_16/transpose_0", "swa_model/cond_2/swa_model/cond_1/Identity/_21"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "swa_model/Conv2D", "op": "Conv2D", "input": ["swa_model/cond_2/output/_22", "swa_model/conv1/w"], "device": "/device:CPU:0", "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/strided_slice_1", "op": "StridedSlice", "input": ["swa_model/cond_2/output/_22", "swa_model/strided_slice_1/stack", "swa_model/strided_slice_1/stack_1", "swa_model/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "7"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "swa_model/add", "op": "AddV2", "input": ["swa_model/Conv2D", "swa_model/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_3", "op": "Sub", "input": ["swa_model/sub_3/x", "swa_model/strided_slice_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Sum_1", "op": "Sum", "input": ["swa_model/strided_slice_1", "swa_model/Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "swa_model/add_1", "op": "AddV2", "input": ["swa_model/add", "swa_model/rconv1/norm1/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_33", "op": "Mul", "input": ["swa_model/sub_3", "swa_model/mul_33/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Sqrt", "op": "Sqrt", "input": ["swa_model/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu", "op": "Relu", "input": ["swa_model/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_7", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_7/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape_5", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_5/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/Reshape_3", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_3/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Reshape_11", "op": "Reshape", "input": ["swa_model/Sqrt", "swa_model/Reshape_11/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_3", "op": "Conv2D", "input": ["swa_model/Relu", "swa_model/Conv2D_1/merged_input"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "swa_model/sub_2", "op": "Sub", "input": ["swa_model/Reshape_7", "swa_model/sub_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_1", "op": "Sub", "input": ["swa_model/Reshape_5", "swa_model/sub_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub", "op": "Sub", "input": ["swa_model/Reshape_3", "swa_model/sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_5", "op": "Sub", "input": ["swa_model/Reshape_11", "swa_model/sub_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_6", "op": "SquaredDifference", "input": ["swa_model/Reshape_11", "swa_model/sub_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_3", "op": "AddV2", "input": ["swa_model/mul_3", "swa_model/rconv1/norm2/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_2", "op": "Mul", "input": ["swa_model/sub_2", "ConstantFolding/swa_model/truediv_2_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_1", "op": "Mul", "input": ["swa_model/sub_1", "ConstantFolding/swa_model/truediv_1_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv", "op": "Mul", "input": ["swa_model/sub", "ConstantFolding/swa_model/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_3", "op": "Mul", "input": ["swa_model/sub_5", "ConstantFolding/swa_model/truediv_3_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/truediv_4", "op": "Mul", "input": ["swa_model/sub_6", "ConstantFolding/swa_model/truediv_4_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_1", "op": "Relu", "input": ["swa_model/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/sub_7", "op": "Sub", "input": ["swa_model/truediv_4", "swa_model/sub_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_2", "op": "Conv2D", "input": ["swa_model/Relu_1", "swa_model/rconv1/w2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/add_4", "op": "AddV2", "input": ["swa_model/add", "swa_model/Conv2D_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_5", "op": "AddV2", "input": ["swa_model/add_4", "swa_model/rconv2/norm1/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_2", "op": "Relu", "input": ["swa_model/add_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_6", "op": "Conv2D", "input": ["swa_model/Relu_2", "swa_model/Conv2D_3/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "swa_model/add_7", "op": "AddV2", "input": ["swa_model/mul_6", "swa_model/rconv2/norm2/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_3", "op": "Relu", "input": ["swa_model/add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_4", "op": "Conv2D", "input": ["swa_model/Relu_3", "swa_model/rconv2/w2"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/add_8", "op": "AddV2", "input": ["swa_model/add_4", "swa_model/Conv2D_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_9", "op": "AddV2", "input": ["swa_model/add_8", "swa_model/rconv3/norm1/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_4", "op": "Relu", "input": ["swa_model/add_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_12", "op": "Conv2D", "input": ["swa_model/Relu_4", "swa_model/Conv2D_5/merged_input"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/Conv2D_6", "op": "Conv2D", "input": ["swa_model/Relu_4", "swa_model/rconv3/w1b"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/add_12", "op": "AddV2", "input": ["swa_model/mul_12", "swa_model/rconv3/norm2/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_10", "op": "AddV2", "input": ["swa_model/Conv2D_6", "swa_model/rconv3/norm1b/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_5", "op": "Relu", "input": ["swa_model/add_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Mean", "op": "Mean", "input": ["swa_model/Relu_5", "swa_model/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Max", "op": "Max", "input": ["swa_model/Relu_5", "swa_model/Max/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_10", "op": "Mul", "input": ["swa_model/Mean", "swa_model/truediv"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/concat", "op": "ConcatV2", "input": ["swa_model/Mean", "swa_model/mul_10", "swa_model/Max", "swa_model/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Tensordot_1/Shape", "op": "Shape", "input": ["swa_model/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/GatherV2_1", "op": "GatherV2", "input": ["swa_model/Tensordot_1/Shape", "swa_model/Tensordot_1/axes", "swa_model/Tensordot_1/GatherV2_1/axis"], "attr": {"Tparams": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "swa_model/Tensordot_1/GatherV2", "op": "GatherV2", "input": ["swa_model/Tensordot_1/Shape", "swa_model/Tensordot_1/free", "swa_model/Tensordot_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/Prod_1", "op": "Prod", "input": ["swa_model/Tensordot_1/GatherV2_1", "swa_model/Tensordot_1/Const_1"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/Prod", "op": "Prod", "input": ["swa_model/Tensordot_1/GatherV2", "swa_model/Tensordot_1/Const"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/concat_1", "op": "ConcatV2", "input": ["swa_model/Tensordot_1/GatherV2", "swa_model/Tensordot_1/Const_2", "swa_model/Tensordot_1/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/stack", "op": "Pack", "input": ["swa_model/Tensordot_1/Prod", "swa_model/Tensordot_1/Prod_1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "swa_model/Tensordot_1/Reshape", "op": "Reshape", "input": ["swa_model/concat", "swa_model/Tensordot_1/stack"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "swa_model/Tensordot_1/MatMul", "op": "MatMul", "input": ["swa_model/Tensordot_1/Reshape", "swa_model/rconv3/w1r"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "swa_model/Tensordot_1", "op": "Reshape", "input": ["swa_model/Tensordot_1/MatMul", "swa_model/Tensordot_1/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_13", "op": "Mul", "input": ["swa_model/Tensordot_1", "swa_model/rconv3/norm2/gamma"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_13", "op": "AddV2", "input": ["swa_model/add_12", "swa_model/mul_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_6", "op": "Relu", "input": ["swa_model/add_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_7", "op": "Conv2D", "input": ["swa_model/Relu_6", "swa_model/rconv3/w2"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "swa_model/add_14", "op": "AddV2", "input": ["swa_model/add_8", "swa_model/Conv2D_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_15", "op": "AddV2", "input": ["swa_model/add_14", "swa_model/rconv4/norm1/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_7", "op": "Relu", "input": ["swa_model/add_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_16", "op": "Conv2D", "input": ["swa_model/Relu_7", "swa_model/Conv2D_8/merged_input"], "device": "/device:CPU:0", "attr": {"explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/add_17", "op": "AddV2", "input": ["swa_model/mul_16", "swa_model/rconv4/norm2/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_8", "op": "Relu", "input": ["swa_model/add_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Conv2D_9", "op": "Conv2D", "input": ["swa_model/Relu_8", "swa_model/rconv4/w2"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}}}, {"name": "swa_model/add_18", "op": "AddV2", "input": ["swa_model/add_14", "swa_model/Conv2D_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/add_19", "op": "AddV2", "input": ["swa_model/add_18", "swa_model/rconv5/norm1/beta"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/Relu_9", "op": "Relu", "input": ["swa_model/add_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "swa_model/mul_22", "op": "Conv2D", "input": ["swa_model/Relu_9", "swa_model/Conv2D_10/merged_input"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "swa_model/Conv2D_11", "op": "Conv2D", "input": ["swa_model/Relu_9", "swa_model/rconv5/w1b"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, 